---
kind: method
id: M:Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.#ctor(Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions)
source: html/752fdae6-0902-bc9f-e7e6-010505c9e1d4.htm
---
# Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.#ctor Method

Creates a copy of an existing options object.

## Syntax (C#)
```csharp
public PromptForFamilyInstancePlacementOptions(
	PromptForFamilyInstancePlacementOptions other
)
```

## Parameters
- **other** (`Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions`) - The options object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null